export const VALIDATORS = {
    lettersOnly: /^(?:[a-zA-ZабвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ'ʼ`"-]+(?:-[a-zA-ZабвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ'ʼ`"-]+)*)(?:\s[a-zA-ZабвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ'ʼ`"-]+(?:-[a-zA-ZабвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ'ʼ`"-]+)?)?$/u,
    phone: /^(?:1[ -])?(?:\(?\d{3}\)?[ .-]?\d{3}[ .-]?\d{4})(?:\s*x\d+)?$/,
    numeric: /^[1-9][0-9]*$/
} as any;